package printReadme;

public class PrintReadme {


    public static void print() {

        System.out.println("");
        System.out.println("*****************************************************************");
        System.out.println("    Парсер обьявлений о продаже недвижимости по Новосибирску.\n" +
                "Программа способна сохранить до 1.350 обьявлений. \n" +
                "Задержки в работе созданы специально - чтобы не перегружать сервер запросами.\n" +

                "\n" +
                "    1. Запуск парсера через батничек \"startParser.bat\"\n" +
                "\n" +
                "    2. Дождись завершения работы программы. \n" +
                "        ( По завершению работы она выдаст звуковой сигнал).\n" +
                "          Теперь окно программы можно закрыть.\n" +
                "    3.Используй сортировку и фильтр для сортировки.\n" +
                "    4. Если загрузились не все обьявления - проверь интернет-соединение,\n" +
                "        возможны пропуски при загруженности вызываемого сервера.\n" +
                "\n" +
                "            Автор - Олег Гюнтер, 04,2020 , Новосибирск.");
        System.out.println("*****************************************************************");
    }

}
